/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   processor.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mmonte <mmonte@student.21-school.ru>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/15 12:54:10 by mmonte            #+#    #+#             */
/*   Updated: 2021/01/16 21:07:32 by mmonte           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
#include <stdio.h> // printf

// Ширина - максимальная длина строки, если мы выводим меньше ширины, то добавляются пробелы или нули слева
// Точность - минимальная. Если точномть больше знакчения, то добавиет нулями слева


int		process_string(va_list var, t_struct *f)
{
	int i;

	i = 0;
	if (f->type == 'd' || f->type == 'i')
		process_ints(var, f);
	if (f->type == 'c' || f->type == '%')
		return (0);
	while (i <= f->length)
		ft_putchar_fd(f->arg[i++], 1);

	free(f->arg);
	return (1);
}
